# Employee and Manager Salaries

Find employees who are earning more than their managers. Output the employee's first name along with the corresponding salary.

In [16]:
# Import your libraries
import pandas as pd

In [17]:
#employee = pd.read_clipboard()
#employee.to_csv('employee.csv',index=False)
employee = pd.read_csv('employee.csv')
employee.head()

,id,first_name,last_name,age,sex,employee_title,department,salary,target,bonus,email,city,address,manager_id
0,5,Max,George,26,M,Sales,Sales,1300,200,150,Max@company.com,California,2638 Richards Avenue,1
1,13,Katty,Bond,56,F,Manager,Management,150000,0,300,Katty@company.com,Arizona,NaN,1
2,11,Richerd,Gear,57,M,Manager,Management,250000,0,300,Richerd@company.com,Alabama,NaN,1
3,10,Jennifer,Dion,34,F,Sales,Sales,1000,200,150,Jennifer@company.com,Alabama,NaN,13
4,19,George,Joe,50,M,Manager,Management,100000,0,300,George@company.com,Florida,1003 Wyatt Street,1

In [18]:
# Check how many managers have employees
employee.manager_id.value_counts()

1     12
19     7
11     6
13     5
Name: manager_id, dtype: int64

### Need to make groups for employees of manger 1, 19, 11, and 13

In [19]:
# create dateframe of for manager id 1, sort by highest salary
one_team = employee.loc[employee['manager_id'] == 1].sort_values(by=['salary'], ascending=False)

# get the managers salary
one_manager_salary = employee.loc[employee['id'] == 1]['salary'].max()

# get the employees who have a higher salary than their manager
one_higher = one_team.loc[one_team['salary'] > one_manager_salary]
one_higher

,id,first_name,last_name,age,sex,employee_title,department,salary,target,bonus,email,city,address,manager_id
2,11,Richerd,Gear,57,M,Manager,Management,250000,0,300,Richerd@company.com,Alabama,NaN,1

In [20]:
# create dateframe of for manager id 13, sort by highest salary
thirteen_team = employee.loc[employee['manager_id'] == 13].sort_values(by=['salary'], ascending=False)

# get the managers salary
thirteen_manager_salary = employee.loc[employee['id'] == 13]['salary'].max()

# get the employees who have a higher salary than their manager
thirteen_higher = thirteen_team.loc[thirteen_team['salary'] > thirteen_manager_salary]
thirteen_higher

Empty DataFrame
Columns: [id, first_name, last_name, age, sex, employee_title, department, salary, target, bonus, email, city, address, manager_id]
Index: []

In [21]:
# create dateframe of for manager id 11, sort by highest salary
elv_team = employee.loc[employee['manager_id'] == 11].sort_values(by=['salary'], ascending=False)

# get the managers salary
elv_manager_salary = employee.loc[employee['id'] == 11]['salary'].max()

# get the employees who have a higher salary than their manager
elv_higher = elv_team.loc[elv_team['salary'] > elv_manager_salary]
elv_higher

Empty DataFrame
Columns: [id, first_name, last_name, age, sex, employee_title, department, salary, target, bonus, email, city, address, manager_id]
Index: []

In [22]:
# create dateframe of for manager id 19, sort by highest salary
nt_team = employee.loc[employee['manager_id'] == 19].sort_values(by=['salary'], ascending=False)

# get the managers salary
nt_manager_salary = employee.loc[employee['id'] == 19]['salary'].max()

# get the employees who have a higher salary than their manager
nt_higher = nt_team.loc[nt_team['salary'] > nt_manager_salary]
nt_higher

Empty DataFrame
Columns: [id, first_name, last_name, age, sex, employee_title, department, salary, target, bonus, email, city, address, manager_id]
Index: []

In [23]:
# Concat the dataframes
final = pd.concat([one_higher, thirteen_higher, elv_higher, nt_higher], axis=0)
final

,id,first_name,last_name,age,sex,employee_title,department,salary,target,bonus,email,city,address,manager_id
2,11,Richerd,Gear,57,M,Manager,Management,250000,0,300,Richerd@company.com,Alabama,NaN,1

### Output the employee's first name along with the corresponding salary.

In [24]:
# Get only the columns we want
final[['first_name','salary']]

  first_name  salary
2    Richerd  250000

# A much more effiencent way...

In [28]:
# merge the eployees dataframe on itself, left will be the manager, right will be their employees
df = pd.merge(employee, employee, how = 'inner', left_on = 'id', right_on = 'manager_id', suffixes=['_manager', '_employee'])
df.head()

,id_manager,first_name_manager,last_name_manager,age_manager,sex_manager,employee_title_manager,department_manager,salary_manager,target_manager,bonus_manager,...,sex_employee,employee_title_employee,department_employee,salary_employee,target_employee,bonus_employee,email_employee,city_employee,address_employee,manager_id_employee
0,13,Katty,Bond,56,F,Manager,Management,150000,0,300,...,F,Sales,Sales,1000,200,150,Jennifer@company.com,Alabama,NaN,13
1,13,Katty,Bond,56,F,Manager,Management,150000,0,300,...,F,Sales,Sales,1400,100,150,Molly@company.com,Arizona,3632 Polk Street,13
2,13,Katty,Bond,56,F,Manager,Management,150000,0,300,...,F,Sales,Sales,1400,400,100,Molly@company.com,Arizona,3461 Preston Street,13
3,13,Katty,Bond,56,F,Manager,Management,150000,0,300,...,F,Sales,Sales,1000,200,100,Molly@company.com,Alabama,NaN,13
4,13,Katty,Bond,56,F,Manager,Management,150000,0,300,...,M,Senior Sales,Sales,1500,140,100,Molly@company.com,Alabama,4832 New Creek Road,13

In [30]:
# Select the first name and salary of the employee where their salary is greater than their managers salary
df[(df.salary_employee > df.salary_manager)][['first_name_employee','salary_employee']]

   first_name_employee  salary_employee
20             Richerd           250000